Revit 2024 API
BuiltInFailures.StairRampFailures.BadRailProfile Property
 One or more Profile Loops are invalid, probably because of self-intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BadRailProfile { get; }
Visual Basic
Public Shared ReadOnly Property BadRailProfile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BadRailProfile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace